tap "anomalyco/tap"
tap "supabase/tap"
# Incredibly fast JavaScript runtime, bundler, test runner, and package manager
brew "bun"
# Binary installation for rust projects
brew "cargo-binstall"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Speech synthesizer that supports more than hundred languages and accents
brew "espeak-ng"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Tool for glamorous shell scripts
brew "gum"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Postgres C API library
brew "libpq", link: true
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Tool for managing OCI containers and pods
brew "podman"
# Cross-shell prompt for astronauts
brew "starship"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Supabase CLI
brew "supabase/tap/supabase", trusted: true
# Enable Windows-like alt-tab
cask "alt-tab"
cask "font-fira-code-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Replacement for Docker Desktop
cask "orbstack"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Multiplayer code editor
cask "zed"
go "cmd/go"
go "cmd/gofmt"
cargo "zellij"
uv "graphifyy"
uv "ruff"
